The type of external file which this object references.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public ExternalFileReferenceType ExternalFileReferenceType { get; }
  Visual Basic
Public ReadOnly Property ExternalFileReferenceType As ExternalFileReferenceType
	Get
  Visual C++
public:
property ExternalFileReferenceType ExternalFileReferenceType {
	ExternalFileReferenceType get ();
}
 See Also
  ExternalFileReference Class
  Autodesk.Revit.DB Namespace